#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan: `success`

<details><summary>Show Plan</summary>

#### stdout
```
module.network.data.oci_identity_availability_domains.ads: Reading...
module.cluster.data.oci_containerengine_node_pool_option.node_pool_option: Reading...
module.cluster.data.oci_identity_availability_domains.ads: Reading...
module.cluster.data.oci_identity_availability_domains.ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-3838085979]
module.network.data.oci_identity_availability_domains.ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-3838085979]
module.cluster.data.oci_containerengine_node_pool_option.node_pool_option: Read complete after 1s [id=ContainerengineNodePoolOptionDataSource-1870923232]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster.oci_containerengine_cluster.platform_cluster will be created
  + resource "oci_containerengine_cluster" "platform_cluster" {
      + available_kubernetes_upgrades = (known after apply)
      + compartment_id                = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags                  = (known after apply)
      + endpoints                     = (known after apply)
      + freeform_tags                 = {
          + "creator"       = "Tod Hansmann"
          + "creator_email" = "tod@phonejanitor.com"
          + "env"           = "everything"
        }
      + id                            = (known after apply)
      + kms_key_id                    = (known after apply)
      + kubernetes_version            = "v1.24.1"
      + lifecycle_details             = (known after apply)
      + metadata                      = (known after apply)
      + name                          = "catalystoci_oke"
      + state                         = (known after apply)
      + vcn_id                        = (known after apply)

      + cluster_pod_network_options {
          + cni_type = "OCI_VCN_IP_NATIVE"
        }

      + endpoint_config {
          + is_public_ip_enabled = true
          + subnet_id            = (known after apply)
        }

      + image_policy_config {
          + is_policy_enabled = (known after apply)

          + key_details {
              + kms_key_id = (known after apply)
            }
        }

      + options {
          + service_lb_subnet_ids = (known after apply)

          + add_ons {
              + is_kubernetes_dashboard_enabled = (known after apply)
              + is_tiller_enabled               = (known after apply)
            }

          + admission_controller_options {
              + is_pod_security_policy_enabled = (known after apply)
            }

          + kubernetes_network_config {
              + pods_cidr     = (known after apply)
              + services_cidr = (known after apply)
            }

          + persistent_volume_config {
              + defined_tags  = (known after apply)
              + freeform_tags = {
                  + "creator"       = "Tod Hansmann"
                  + "creator_email" = "tod@phonejanitor.com"
                  + "env"           = "everything"
                }
            }

          + service_lb_config {
              + defined_tags  = (known after apply)
              + freeform_tags = {
                  + "creator"       = "Tod Hansmann"
                  + "creator_email" = "tod@phonejanitor.com"
                  + "env"           = "everything"
                }
            }
        }
    }

  # module.cluster.oci_containerengine_node_pool.platform_nodepool_a will be created
  + resource "oci_containerengine_node_pool" "platform_nodepool_a" {
      + cluster_id          = (known after apply)
      + compartment_id      = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags        = (known after apply)
      + freeform_tags       = (known after apply)
      + id                  = (known after apply)
      + kubernetes_version  = "v1.24.1"
      + lifecycle_details   = (known after apply)
      + name                = "catalystoci_nodepool_a"
      + node_image_id       = (known after apply)
      + node_image_name     = (known after apply)
      + node_metadata       = (known after apply)
      + node_shape          = "VM.Standard.E4.Flex"
      + node_source         = (known after apply)
      + nodes               = (known after apply)
      + quantity_per_subnet = (known after apply)
      + ssh_public_key      = (known after apply)
      + state               = (known after apply)
      + subnet_ids          = (known after apply)

      + initial_node_labels {
          + key   = (known after apply)
          + value = (known after apply)
        }

      + node_config_details {
          + defined_tags                        = (known after apply)
          + freeform_tags                       = {
              + "creator"       = "Tod Hansmann"
              + "creator_email" = "tod@phonejanitor.com"
              + "env"           = "everything"
            }
          + is_pv_encryption_in_transit_enabled = true
          + kms_key_id                          = (known after apply)
          + nsg_ids                             = (known after apply)
          + size                                = 1

          + node_pool_pod_network_option_details {
              + cni_type          = "OCI_VCN_IP_NATIVE"
              + max_pods_per_node = 30
              + pod_nsg_ids       = (known after apply)
              + pod_subnet_ids    = (known after apply)
            }

          + placement_configs {
              + availability_domain     = "QsuK:PHX-AD-1"
              + capacity_reservation_id = (known after apply)
              + fault_domains           = (known after apply)
              + subnet_id               = (known after apply)
            }
        }

      + node_eviction_node_pool_settings {
          + eviction_grace_duration              = (known after apply)
          + is_force_delete_after_grace_duration = (known after apply)
        }

      + node_shape_config {
          + memory_in_gbs = 16
          + ocpus         = 1
        }

      + node_source_details {
          + boot_volume_size_in_gbs = "50"
          + image_id                = "ocid1.image.oc1.phx.aaaaaaaan7lpv4nxnx4r772csco2nzre3owzqdebf75ty6mlbp562vn6c45q"
          + source_type             = "IMAGE"
        }
    }

  # module.cluster.oci_containerengine_node_pool.platform_nodepool_b will be created
  + resource "oci_containerengine_node_pool" "platform_nodepool_b" {
      + cluster_id          = (known after apply)
      + compartment_id      = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags        = (known after apply)
      + freeform_tags       = (known after apply)
      + id                  = (known after apply)
      + kubernetes_version  = "v1.24.1"
      + lifecycle_details   = (known after apply)
      + name                = "catalystoci_nodepool_b"
      + node_image_id       = (known after apply)
      + node_image_name     = (known after apply)
      + node_metadata       = (known after apply)
      + node_shape          = "VM.Standard.E4.Flex"
      + node_source         = (known after apply)
      + nodes               = (known after apply)
      + quantity_per_subnet = (known after apply)
      + ssh_public_key      = (known after apply)
      + state               = (known after apply)
      + subnet_ids          = (known after apply)

      + initial_node_labels {
          + key   = (known after apply)
          + value = (known after apply)
        }

      + node_config_details {
          + defined_tags                        = (known after apply)
          + freeform_tags                       = {
              + "creator"       = "Tod Hansmann"
              + "creator_email" = "tod@phonejanitor.com"
              + "env"           = "everything"
            }
          + is_pv_encryption_in_transit_enabled = true
          + kms_key_id                          = (known after apply)
          + nsg_ids                             = (known after apply)
          + size                                = 1

          + node_pool_pod_network_option_details {
              + cni_type          = "OCI_VCN_IP_NATIVE"
              + max_pods_per_node = 30
              + pod_nsg_ids       = (known after apply)
              + pod_subnet_ids    = (known after apply)
            }

          + placement_configs {
              + availability_domain     = "QsuK:PHX-AD-2"
              + capacity_reservation_id = (known after apply)
              + fault_domains           = (known after apply)
              + subnet_id               = (known after apply)
            }
        }

      + node_eviction_node_pool_settings {
          + eviction_grace_duration              = (known after apply)
          + is_force_delete_after_grace_duration = (known after apply)
        }

      + node_shape_config {
          + memory_in_gbs = 16
          + ocpus         = 1
        }

      + node_source_details {
          + boot_volume_size_in_gbs = "50"
          + image_id                = "ocid1.image.oc1.phx.aaaaaaaan7lpv4nxnx4r772csco2nzre3owzqdebf75ty6mlbp562vn6c45q"
          + source_type             = "IMAGE"
        }
    }

  # module.network.oci_core_internet_gateway.platform_internet_gateway will be created
  + resource "oci_core_internet_gateway" "platform_internet_gateway" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags   = (known after apply)
      + display_name   = "catalystoci_ig"
      + enabled        = true
      + freeform_tags  = {
          + "infra_from" = "Catalyst Platform"
        }
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # module.network.oci_core_network_security_group.platform_nsg will be created
  + resource "oci_core_network_security_group" "platform_nsg" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags   = (known after apply)
      + display_name   = "catalystoci_nsg"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # module.network.oci_core_route_table.platform_rt will be created
  + resource "oci_core_route_table" "platform_rt" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags   = (known after apply)
      + display_name   = "catalystoci-rt"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = (known after apply)
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # module.network.oci_core_security_list.platform_sl will be created
  + resource "oci_core_security_list" "platform_sl" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags   = (known after apply)
      + display_name   = "catalystoci_sl"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = (known after apply)
          + protocol         = "all"
          + stateless        = (known after apply)
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "all"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false
        }
    }

  # module.network.oci_core_subnet.platform_subnets["10.20.0.0/16"] will be created
  + resource "oci_core_subnet" "platform_subnets" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.20.0.0/16"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "catalystoci_subnet_1"
      + dns_label                  = (known after apply)
      + freeform_tags              = {
          + "infra_from" = "Catalyst Platform"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # module.network.oci_core_subnet.platform_subnets["10.21.0.0/16"] will be created
  + resource "oci_core_subnet" "platform_subnets" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.21.0.0/16"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "catalystoci_subnet_2"
      + dns_label                  = (known after apply)
      + freeform_tags              = {
          + "infra_from" = "Catalyst Platform"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # module.network.oci_core_subnet.platform_subnets["10.22.0.0/16"] will be created
  + resource "oci_core_subnet" "platform_subnets" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.22.0.0/16"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "catalystoci_subnet_3"
      + dns_label                  = (known after apply)
      + freeform_tags              = {
          + "infra_from" = "Catalyst Platform"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # module.network.oci_core_subnet.platform_subnets["10.23.0.0/16"] will be created
  + resource "oci_core_subnet" "platform_subnets" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.23.0.0/16"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "catalystoci_subnet_4"
      + dns_label                  = (known after apply)
      + freeform_tags              = {
          + "infra_from" = "Catalyst Platform"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # module.network.oci_core_vcn.platform_vcn will be created
  + resource "oci_core_vcn" "platform_vcn" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = (known after apply)
      + cidr_blocks                      = [
          + "10.20.0.0/16",
          + "10.21.0.0/16",
          + "10.22.0.0/16",
          + "10.23.0.0/16",
        ]
      + compartment_id                   = "ocid1.tenancy.oc1..aaaaaaaafnc4ezkn7qo5neppywgy6hxgxyi7fgsjxo5n5e2wgxh7hviwh26a"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "catalystoci_vcn"
      + dns_label                        = "catalystocivcn"
      + freeform_tags                    = {
          + "infra_from" = "Catalyst Platform"
        }
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = (known after apply)
      + is_oracle_gua_allocation_enabled = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)

      + byoipv6cidr_details {
          + byoipv6range_id = (known after apply)
          + ipv6cidr_block  = (known after apply)
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_id           = (known after apply)
  + cluster_pub_endpoint = (known after apply)
  + oke_image_id         = "ocid1.image.oc1.phx.aaaaaaaan7lpv4nxnx4r772csco2nzre3owzqdebf75ty6mlbp562vn6c45q"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

#### stderr
```

```

</details>

*Action: `pull_request`, Working Directory: `nsccluster`, Workflow: `Validate pull request`*